Revit 2027 API
RevitEventArgs.Cancellable Property
 Indicates whether an event may be cancelled by an event delegate.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Cancellable { get; }
Public Overridable ReadOnly Property Cancellable As Boolean
	Get
public:
virtual property bool Cancellable {
	bool get ();
}
abstract Cancellable : bool with get
override Cancellable : bool with get
Property Value
Boolean
Remarks
 If 'Cancellable' is true, event delegates may cancel the command that was announced by the event. To do so, a delegate would set the 'Cancel' property to True. Typically, post-events (e.g. DocumentPrinted) are not cancellable, while most pre-events (e.g. DocumentPrinting) are cancellable, except for special conditions and situations, such as when the Revit application is being closed or if an event is raised during another event.
See Also
Reference
RevitEventArgs Class
Autodesk.Revit.DB.Events Namespace